In [1]:
import numpy as np
import pandas as pd
import sklearn

In [2]:
df = pd.read_csv('Social_Network_Ads.csv', sep=",")

In [3]:
df.head(5) #Por default tiene 5 filas

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
df.tail() #Muetra los ultimos 5

      User ID  Gender  Age  EstimatedSalary  Purchased
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

In [5]:
df.shape #Es el tama√±o

(400, 5)

In [6]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [7]:
print(df)

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [8]:
df.loc[df['Gender'] == 'Male', 'Male']= 1
df.loc[df['Gender'] == 'Female', 'Male']= 0
df

      User ID  Gender  Age  EstimatedSalary  Purchased  Male
0    15624510    Male   19            19000          0   1.0
1    15810944    Male   35            20000          0   1.0
2    15668575  Female   26            43000          0   0.0
3    15603246  Female   27            57000          0   0.0
4    15804002    Male   19            76000          0   1.0
..        ...     ...  ...              ...        ...   ...
395  15691863  Female   46            41000          1   0.0
396  15706071    Male   51            23000          1   1.0
397  15654296  Female   50            20000          1   0.0
398  15755018    Male   36            33000          0   1.0
399  15594041  Female   49            36000          1   0.0

[400 rows x 6 columns]

In [9]:
df.loc[df['Gender'] == 'Female', 'Female']= 1
df.loc[df['Gender'] == 'Male', 'Female']= 0
df

      User ID  Gender  Age  EstimatedSalary  Purchased  Male  Female
0    15624510    Male   19            19000          0   1.0     0.0
1    15810944    Male   35            20000          0   1.0     0.0
2    15668575  Female   26            43000          0   0.0     1.0
3    15603246  Female   27            57000          0   0.0     1.0
4    15804002    Male   19            76000          0   1.0     0.0
..        ...     ...  ...              ...        ...   ...     ...
395  15691863  Female   46            41000          1   0.0     1.0
396  15706071    Male   51            23000          1   1.0     0.0
397  15654296  Female   50            20000          1   0.0     1.0
398  15755018    Male   36            33000          0   1.0     0.0
399  15594041  Female   49            36000          1   0.0     1.0

[400 rows x 7 columns]

In [10]:
df = df.drop( columns='Gender', axis = 1)

In [11]:
df = df.drop( columns='User ID', axis = 1)
df

     Age  EstimatedSalary  Purchased  Male  Female
0     19            19000          0   1.0     0.0
1     35            20000          0   1.0     0.0
2     26            43000          0   0.0     1.0
3     27            57000          0   0.0     1.0
4     19            76000          0   1.0     0.0
..   ...              ...        ...   ...     ...
395   46            41000          1   0.0     1.0
396   51            23000          1   1.0     0.0
397   50            20000          1   0.0     1.0
398   36            33000          0   1.0     0.0
399   49            36000          1   0.0     1.0

[400 rows x 5 columns]

In [12]:
df_train = df.iloc[:320] #Separamos el 80% del set para train

In [13]:
df_train.shape

(320, 5)

In [14]:
print(df_train)

     Age  EstimatedSalary  Purchased  Male  Female
0     19            19000          0   1.0     0.0
1     35            20000          0   1.0     0.0
2     26            43000          0   0.0     1.0
3     27            57000          0   0.0     1.0
4     19            76000          0   1.0     0.0
..   ...              ...        ...   ...     ...
315   39            75000          1   0.0     1.0
316   54           104000          1   0.0     1.0
317   35            55000          0   1.0     0.0
318   45            32000          1   1.0     0.0
319   36            60000          0   1.0     0.0

[320 rows x 5 columns]

In [15]:
df_test = df.iloc[320:] #Separamos el 20% del set para test

In [16]:
df_test.shape

(80, 5)

In [17]:
print(df_test)

     Age  EstimatedSalary  Purchased  Male  Female
320   52           138000          1   0.0     1.0
321   53            82000          1   0.0     1.0
322   41            52000          0   1.0     0.0
323   48            30000          1   0.0     1.0
324   48           131000          1   0.0     1.0
..   ...              ...        ...   ...     ...
395   46            41000          1   0.0     1.0
396   51            23000          1   1.0     0.0
397   50            20000          1   0.0     1.0
398   36            33000          0   1.0     0.0
399   49            36000          1   0.0     1.0

[80 rows x 5 columns]

In [18]:
y = df['Purchased']

In [19]:
print(y)

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [20]:
y_train = y.iloc[:320] #Separamos el 80% del set para train del output

In [21]:
y_train.shape

(320,)

In [22]:
print(y_train)

0      0
1      0
2      0
3      0
4      0
      ..
315    1
316    1
317    0
318    1
319    0
Name: Purchased, Length: 320, dtype: int64

In [23]:
y_test = y.iloc[320:] #Separamos el 20% del set para test del output

In [24]:
y_test.shape

(80,)

In [25]:
print(y_test)

320    1
321    1
322    0
323    1
324    1
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 80, dtype: int64

In [26]:
from sklearn.linear_model import Perceptron
clf = Perceptron(tol=1e-3, random_state=0)

In [27]:
clf.fit(df_train, y_train)

Perceptron()

In [28]:
clf.score(df_train, y_train)

0.7125

In [29]:
clf.predict(df_test)

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], dtype=int64)

In [30]:
y_test

320    1
321    1
322    0
323    1
324    1
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 80, dtype: int64